Revit 2027 API
ScheduleDefinition.RemoveField(ScheduleFieldId) Method
 Removes a field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveField(
	ScheduleFieldId fieldId
)
Public Sub RemoveField (
	fieldId As ScheduleFieldId
)
public:
void RemoveField(
	ScheduleFieldId^ fieldId
)
member RemoveField :
        fieldId : ScheduleFieldId -> unit
Parameters
fieldId ScheduleFieldId
 The ID of the field to remove.
Exceptions
Exception | Condition
ArgumentException |  fieldId is not the ID of a field in this ScheduleDefinition.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ScheduleDefinition Class
RemoveField Overload
Autodesk.Revit.DB Namespace